###################################
# Add custom taps
###################################
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"

###################################
# Install applications via Homebrew
###################################

# Essentials
brew "brew-cask-completion"
brew "git"
brew "git-extras"
brew "yarn"

# ZSH specific
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

# Manage node
brew "n"

# Manage ruby
brew "rbenv"

# Unix utilities
brew "tree"
brew "wget"

# Utilities
brew "cheat"
brew "gpg"
# brew "httpie"
brew "mycli"
# brew "nmap"
brew "openssl"
brew "python3"
brew "thefuck"
# brew "wrk"

# Native dev
# brew "pidcat"
# brew "watchman"

###################################
# Install applications via Cask
###################################

# Essentials
cask "iterm2"
cask "lastpass"
cask "sequel-pro"
cask "station"
cask "toggl"
cask "tunnelblick"

# Virtual Machines
# cask "vagrant"
# cask "vagrant-manager"
# cask "virtualbox"

# Native dev
# cask "android-studio"
# cask "android-platform-tools"
# cask "java" # java 7
# cask "java8"

# Browsers
# cask "firefox"
# cask "firefox-developer-edition"
cask "google-chrome"

# Editors
# cask "atom"
# cask "phpstorm"
# cask "sublime-text"
# cask "visual-studio-code"
# cask "webstorm"

# Quick Look
cask "qlcolorcode"
cask "qlstephen"
cask "qlmarkdown"
cask "quicklook-csv"
cask "quicklook-json"
cask "qlimagesize"
cask "webpquicklook"
cask "suspicious-package"
cask "quicklookase"
cask "qlvideo"
cask "betterzip"

# Fonts
cask "font-awesome-terminal-fonts"

# Utilities
# cask "alfred"
cask "docker"
# cask "etcher"
cask "flux"
# cask "google-backup-and-sync"
cask "gpg-suite"
cask "postman"
# cask "skype"
# cask "skitch"
# cask "slack"
cask "spectacle"
# cask "spotify"
cask "the-unarchiver"
cask "vlc"
