tap "drone/drone"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "wix/brew"
brew "aws-iam-authenticator"
brew "brew-cask-completion"
brew "cheat"
brew "gcc"
brew "git"
brew "git-extras"
brew "python"
brew "gnupg", link: false
brew "go"
brew "httpie"
brew "imagemagick"
brew "jq"
brew "kubernetes-cli", link: false
brew "lastpass-cli"
brew "mas"
brew "mysql"
brew "nmap"
brew "nvm"
brew "openvpn", restart_service: true
brew "packer"
brew "pidcat"
brew "ruby-build"
brew "rbenv"
brew "shellcheck"
brew "swi-prolog"
brew "terraform"
brew "thefuck"
brew "tmux"
brew "tree"
brew "vault"
brew "watchman"
brew "wget"
brew "yarn"
brew "z"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "drone/drone/drone"
brew "heroku/brew/heroku"
cask "alfred"
cask "android-platform-tools"
cask "android-studio"
cask "atom"
cask "aws-vault"
cask "betterzip"
cask "docker"
cask "filezilla"
cask "google-cloud-sdk"
cask "gpg-suite"
cask "java8"
cask "lastpass"
cask "opensim"
cask "postman"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-csv"
cask "quicklook-json"
cask "quicklookase"
cask "react-native-debugger"
cask "spectacle"
cask "suspicious-package"
cask "the-unarchiver"
cask "toggl"
cask "tunnelblick"
cask "vagrant"
cask "vagrant-manager"
cask "virtualbox"
cask "vlc"
cask "webpquicklook"
mas "Apple Configurator 2", id: 1037126344
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
